Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Numbers are treated as 64-bit floating point values so that the decimal portion of each number (if any) is taken into account.
ja: 数値は64ビットの浮動小数点値として扱われ、各数値の10進数部分（もしあれば）が考慮されます。

source: Numbers may appear in either decimal or hexadecimal format (e.g. 0xF9E0).
ja: 数値は10進数または16進数（例：0xF9E0）で表示することができます。

source: Numbers may be automatically converted to strings (text) and vice versa, depending on the situation.
ja: 数値は、状況に応じて自動的に文字列（テキスト）に変換されたり、その逆も可能です。

source: Numbers written with a decimal point are always considered to be floating-point, even if the fractional part is zero.
ja: 小数点のある数値は、小数部が0であっても、常に浮動小数点とみなされます。

source: Numeric comparison is still performed when both operands are numeric and at least one operand is a pure number (not a string).
ja: 数値比較は、両方のオペランドが数値であり、少なくとも1つのオペランドが純粋な数値（文字列ではない）である場合にも実行されます。

source: Numeric components are always considered lower than non-numeric components in the same position.
ja: 数値成分は、同じ位置にある非数値成分よりも常に下位とみなされます。

source: Numeric components are compared numerically.
ja: 数値要素は数値で比較します。

source: Numeric resource IDs should consist of a hash sign (#) followed by a decimal number.
ja: 数値リソースIDは、ハッシュ記号（#）に続く10進数で構成されなければならない。

source: Numeric values can be combined with string options, or Options can be a pure integer.
ja: 数値は文字列オプションと組み合わせることができ、オプションは純粋な整数とすることができます。

source: Numpad 000 Key
ja: テンキー

source: Numpad Keys
ja: テンキー

source: Numpad digit keys (as seen when NumLock is ON).
ja: Numpadの数字キー（NumLockがONの時の状態です）。

source: Numpad0::Send "{Numpad0}" ; Make the release of Numpad0 produce a Numpad0 keystroke. See comment below.
ja: Numpad0::Send "{Numpad0}" ; Numpad0 のリリースでNumpad0 のキーストロークを生成させる。以下のコメント参照。

source: Numpad0::WinMaximize "A" ; Maximize the active/foreground window.
ja: Numpad0::WinMaximize "A" ; アクティブ／フォアグラウンドウィンドウを最大化します。

source: OK (that is, only an OK button is displayed)
ja: OK

source: OK, Cancel
ja: OK、キャンセル

source: OPEN_EXISTING := 3 ; This mode indicates that the file to be opened must already exist.
ja: OPEN_EXISTING := 3 ; このモードは、オープンするファイルが既に存在することを示します。

source: OS DPI Scaling
ja: OSのDPIスケーリング

source: OSErrors have an additional Number property which contains the error code.
ja: OSErrors には、エラーコードを格納するNumberプロパティが追加されています。

source: Obeys a command or expression.
ja: 命令や表現に従う。

source: Obeys isolated AutoHotkey commands or expressions, with result in U_Name.
ja: U_Name の結果を持つ、孤立した AutoHotkey コマンドまたは式に従います。

source: ObjAddRef / ObjRelease - Syntax & Usage | AutoHotkey v2
ja: ObjAddRef / ObjRelease - 構文と使用法｜AutoHotkey v2

source: ObjBindMethod - Syntax & Usage | AutoHotkey v2
ja: ObjBindMethod - 構文と使用法｜AutoHotkey v2

source: ObjCount was replaced with ObjOwnPropCount (a function only, for all Objects) and Map has its own Count property.
ja: ObjCountはObjOwnPropCount（機能のみ、すべてのObjectに対して）に置き換えられ、Mapは独自のCountプロパティを持ちます。

source: ObjFromPtr assumes that address is a counted reference, and claims ownership of it.
ja: ObjFromPtrは、アドレスがカウントされた参照であると仮定し、その所有権を主張する。

source: ObjHasOwnProp, ObjOwnProps: Equivalent to the corresponding predefined method, but cannot be overridden.
ja: ObjHasOwnProp、ObjOwnProps：対応する定義済みメソッドと同等ですが、オーバーライドすることはできません。

source: ObjRawGet and ObjRawSet were merged into GetOwnPropDesc and DefineProp.
ja: ObjRawGetとObjRawSetは、GetOwnPropDescと DefinePropに統合されました。

source: ObjRelease(address)
ja: ObjRelease(アドレス)

source: Object - Methods & Properties | AutoHotkey v2
ja: Object - メソッドとプロパティ｜AutoHotkey v2

source: Object references are copied (like with a normal assignment), not the objects themselves.
ja: オブジェクトの参照はコピーされますが（通常の代入と同様）、オブジェクトそのものはコピーされません。

source: Object references are copied (like with a normal assignment), not the objects themselves; in other words, if a property contains a reference to an object, the clone will contain a reference to the same object.
ja: オブジェクトの参照がコピーされるのであって、オブジェクトそのものがコピーされるわけではありません。言い換えれば、プロパティにオブジェクトへの参照が含まれている場合、クローンには同じオブジェクトへの参照が含まれます。

source: Object Literal
ja: オブジェクト・リテラル

source: Object Protocol
ja: オブジェクトプロトコル

source: Object is now the root class for all user-defined and built-in objects (this excludes VarRef and COM objects).
ja: Objectは、すべてのユーザー定義および組み込みオブジェクトのルートクラスとなりました（VarRefおよびCOMオブジェクトは除きます）。

source: Object with HWND
ja: HWNDを持つオブジェクト

source: Object, Array and Map are now separate types, and array elements are separate from properties.
ja: Object、Array、Mapはそれぞれ別の型となり、配列の要素はプロパティとは別になりました。

source: Objects - Definition & Usage | AutoHotkey v2
ja: オブジェクト - 定義と使用法｜AutoHotkey v2

source: Objects allow a group of values to be treated as one value, to be assigned to a single variable, passed to or returned from a function, and so on.
ja: オブジェクトは、複数の値を1つの値として扱ったり、1つの変数に代入したり、関数に渡したり、関数から戻したりすることができます。

source: Objects also have methods, but these are just properties which can be called.
ja: オブジェクトにもメソッドがありますが、これは呼び出すことができるプロパティにすぎません。

source: Objects and Arrays can be used to return multiple values or even named values:
ja: オブジェクトや配列は、複数の値や名前付きの値も返すことができます：

source: Objects are prototype-based.
ja: オブジェクトはプロトタイプベース。

source: Objects are always considered true when a boolean value is required, such as in if obj, !obj or obj ? x : y.
ja: オブジェクトは、if obj,!obj,obj ? x : yのように、ブール値が要求される場合は常にtrueとみなされます。

source: Objects are not contained; they are referenced.
ja: オブジェクトは含まれるものではなく、参照されるものです。

source: Objects can be used to represent more complex sets of information by combining them with other objects.
ja: オブジェクトは、他のオブジェクトと組み合わせることで、より複雑な情報の集合を表現することができます。

source: Objects can contain string values (but not keys) which contain binary zero.
ja: オブジェクトには、2進数の0を含む文字列値（キーは不可）を含めることができます。

source: Objects created within an expression or returned from a function are now held until expression evaluation is complete, and then released.
ja: 式内で生成されたオブジェクトや関数から返されたオブジェクトは、式の評価が完了するまで保持され、その後解放されるようになりました。

source: Objects have the following attributes:
ja: オブジェクトには以下の属性があります：

source: Objects in AutoHotkey support the following basic messages:
ja: AutoHotkeyのオブジェクトは、以下の基本的なメッセージに対応しています：

source: Objects now use a more structured class-prototype approach, separating class/static members from instance members.
ja: オブジェクトは、より構造化されたクラス-プロトタイプのアプローチを採用し、クラス/静的メンバとインスタンスメンバを分離しています。

source: Objects which can be called.
ja: 呼び出すことができるオブジェクト。

source: Objects work through the principle of message passing.
ja: オブジェクトは、メッセージパッシングの原理で動作します。

source: Obtains ToolTip information by sending the TVN_GETINFOTIP notification.
ja: TVN_GETINFOTIP通知を送信して、ToolTip情報を取得します。

source: Of course, in that case any literal single quotes (or apostrophes) in the text would need to be escaped (`').
ja: もちろん、その場合、テキスト中の文字通りのシングルクォート（またはアポストロフィー）はエスケープ（`'）する必要があります。

source: Of course, you can always open a text editor first and then open the script as you would any other text file.
ja: もちろん、最初にテキストエディタを開き、他のテキストファイルと同じようにスクリプトを開くこともできます。

source: Of the three sending modes, SendPlay is the most unusual because it does not simulate keystrokes and mouse clicks per se.
ja: 3つの送信モードのうち、SendPlayはキー操作やマウスクリックそのものをシミュレートしていないため、最も珍しいものです。

source: Of the three, & has the highest precedence and | has the lowest.
ja: この3つのうち、&が最も優先順位が高く、|が最も低い。

source: Offset calculation for fields in structures which contain one or more pointers.
ja: 1つ以上のポインタを含む構造体のフィールドのオフセット計算を行う。

source: Often a command line needs to include some variables.
ja: コマンドラインには、しばしばいくつかの変数を含める必要があります。

source: Often the key would be contained by a variable, such as MyMap[modifierChar].
ja: 多くの場合、キーはMyMap[modifierChar]のような変数に含まれる。

source: Often the name of a window's class is related to the app or the purpose of the window.
ja: ウィンドウのクラス名は、アプリやウィンドウの目的に関連していることがよくあります。

source: Often used to label other controls.
ja: 他のコントロールのラベルに使用されることが多い。

source: Often used with Run/RunWait.
ja: Run/RunWaitと一緒に使われることが多い。

source: Often when passing command-line parameters to a program, it is necessary to enclose each parameter in quote marks if the parameter contains a space.
ja: コマンドラインパラメーターをプログラムに渡す際、パラメーターにスペースが含まれている場合、各パラメーターを引用符で囲む必要があることがよくあります。

source: Okay, so the new code doesn't work.
ja: なるほど、新しいコードは動かないんですね。

source: Olive
ja: Olive（オリーブ）

source: Omit FileName or specify an empty string or "*" to remove the item's current icon.
ja: FileNameを省略するか、空文字列または"*"を指定すると、アイテムの現在のアイコンが削除されます。

source: Omit StartingPos to search the entire string.
ja: 文字列全体を検索する場合は、StartingPosを省略します。

source: Omit ColorValue (or specify an empty string or the word "Default") to restore the menu to its default color.
ja: ColorValueを省略（または空文字列または "Default "を指定）すると、メニューの色をデフォルトに戻すことができます。

source: Omit both parameters to restore the font to the system's default GUI typeface, size, and color.
ja: 両方のパラメーターを省略すると、フォントをシステムのデフォルトのGUI書体、サイズ、色に戻すことができます。

source: Omit both parameters to retrieve the current contents of the clipboard.
ja: 両方のパラメータを省略すると、クリップボードの現在の内容を取得することができます。

source: Omit both parameters to set the font to the GUI's current font, as set by Gui.SetFont.
ja: 両方のパラメータを省略すると、Gui.SetFontで設定されたGUIのカレントフォントに設定されます。

source: Omit subsequently-executed lines from the history.
ja: その後に実行された行を履歴から省略します。

source: Omit the X, Y, W, and H options below to have the window retain its previous size and position.
ja: 以下のX、Y、W、Hのオプションを省略すると、ウィンドウは以前のサイズと位置を維持します。

source: Omit the ending character of auto-replace hotstrings when the replacement is produced.
ja: 自動置換されたホットストリングの末尾文字を、置換が行われる際に省略します。

source: Omit the index to use the next input value in the sequence (even if it has been used earlier in the string).
ja: インデックスを省略すると、（文字列の前のほうで使われていたとしても）シーケンスの次の入力値を使用します。

source: Omit the parameter or specify an empty string instead (this works in both v1 and v2).
ja: パラメータを省略するか、代わりに空文字列を指定します（v1、v2ともに有効です）。

source: Omit this parameter or pass true (any non-zero, non-blank value) to require that the hook be installed.
ja: このパラメータを省略するか、true（0以外の空白でない値）を渡すと、フックのインストールを要求します。

source: Omit this parameter to check whether Value itself is callable.
ja: Value自身が呼び出し可能かどうかを確認する場合は、このパラメータを省略します。

source: Omit this parameter to leave the current PressDuration unchanged.
ja: 現在のPressDurationを変更しない場合は、このパラメータは省略されます。

source: Omit this parameter to left it unchanged.
ja: このパラメータを省略すると、変更されないままとなります。

source: Omit this parameter to perform validation on Value itself and return Value if successful.
ja: このパラメータを省略すると、Value自体のバリデーションが行われ、成功した場合にValueが返されます。

source: Omit this parameter to show the script's main window, equivalent to selecting the "View->Key history" menu item.
ja: このパラメータを省略すると、スクリプトのメインウィンドウが表示され、「表示->キーヒストリー」メニュー項目を選択した場合と同じになります。

source: Omits subsequently-executed lines from the history.
ja: その後に実行された行を履歴から省略します。

source: Omitted
ja: 省略

source: Omitting either X, Y or both is useful to make a GUI layout automatically adjust to any future changes you might make to the size of controls or font.
ja: X、Y、またはその両方を省略すると、将来コントロールやフォントのサイズを変更したときに、GUIレイアウトを自動的に調整するのに便利です。

source: Omitting the Control parameter causes the function to use the target window (specified by WinTitle) instead of one of its controls.
ja: Controlパラメータを省略すると、この関数はターゲットウィンドウ（Controlパラメータで指定した WinTitle)のコントロールの1つではなく、そのコントロールの1つです。

source: Omitting the method name as in .() now causes a load-time error message.
ja: .() のようにメソッド名を省略すると、ロードタイムエラーメッセージが表示されるようになりました。

source: On 64-bit builds, UPtr is equivalent to Int64.
ja: 64ビットビルドでは、UPtrはInt64と同等です。

source: On 64-bit systems, 32-bit applications run on a subsystem of Windows called WOW64.
ja: 64ビットシステムでは、32ビットアプリケーションは、WOW64と呼ばれるWindowsのサブシステム上で動作します。

source: On 64-bit systems, the script's own environment heavily depends on whether the EXE running it is 32-bit or 64-bit.
ja: 64ビットシステムでは、スクリプトを実行するEXEが32ビットか64ビットかに応じて、スクリプト自身の環境が大きく変化します。

source: On 64-bit systems (and not 32-bit systems), the following applies:
ja: 64ビット・システムでは（32ビット・システムではなく）、以下が適用される：

source: On Windows 10 and earlier, to display tooltip text containing ampersands (&), escape each ampersand with two additional ampersands.
ja: Windows 10以前では、アンパサンド（&）を含むツールチップテキストを表示するには、各アンパサンドをさらに2つのアンパサンドでエスケープします。

source: On Windows 10 version 1607 and later, the SetThreadDpiAwarenessContext system function can be used to change the program's DPI awareness setting at runtime.
ja: Windows 10のバージョン1607以降では、SetThreadDpiAwarenessContextシステム関数を使用して、実行時にプログラムのDPI認識設定を変更できます。

source: On Windows 10 version 1703 and later, -3 can be replaced with -4 to enable the "Per Monitor v2" mode.
ja: Windows 10のバージョン1703以降では、-3を-4に置き換えて「Per Monitor v2」モードを有効にすることができます。

source: On Windows 10, 2& must be replaced with 3& due to the new "New Window" menu item.
ja: Windows 10では、「新しいウィンドウ」メニューが新設されたため、2&を3&に置き換えてください。

source: On Windows 10, a TrayTip window usually looks like this:
ja: Windows10では、TrayTipウィンドウは通常このように表示される：

source: On Windows 10, a toast notification may be shown instead.
ja: Windows 10の場合、代わりにトースト通知が表示されることがあります。

source: On Windows 10, the processes of those are indicated with a green leaf in the Task Manager.
ja: Windows 10では、タスクマネージャーでそれらのプロセスが緑の葉で表示されます。

source: On Windows 10, the small tray icon is generally displayed even if the "tray icon" option (4) is omitted, and specifying this option may cause the program's name to be shown in the notification.
ja: Windows10では、「トレイアイコン」オプション(4)を省略しても、通常は小さなトレイアイコンが表示され、このオプションを指定すると、通知にプログラム名が表示される場合があります。

source: On Windows 7 and later, it is also set for 64-bit processes.
ja: Windows 7以降では、64ビットプロセスにも設定されている。

source: On Windows 8 and above, this also changes the script's name in Task Manager under "Processes".
ja: Windows 8以上では、タスクマネージャの「プロセス」でスクリプトの名前も変更されます。

source: On Windows 8.1 and later, secondary screens can have different DPI settings, and "per-monitor DPI-aware" applications are expected to scale their windows according to the DPI of whichever screen they are currently on, adapting dynamically when the window moves between screens.
ja: Windows 8.1以降では、セカンダリスクリーンは異なるDPI設定を持つことができ、「モニターごとのDPI対応」アプリケーションは、ウィンドウがスクリーン間を移動するときに動的に適応し、現在表示されているスクリーンのDPIに従ってウィンドウを拡大縮小することが期待されています。

source: On Windows Vista and later, the system displays a user interface showing which program is blocking shutdown/logoff and allowing the user to force shutdown/logoff.
ja: Windows Vista以降では、シャットダウン/ログオフをブロックしているプログラムを示すユーザーインターフェイスを表示し、ユーザーが強制的にシャットダウン/ログオフできるようにします。

source: On a related note, hotstrings are exclusively for detecting text entry, so the symbols ^!+#{} have no special meaning within the hotstring trigger text.
ja: なお、ホットストリングはテキスト入力の検出専用なので、ホットストリングトリガーのテキスト内では、記号^!+#{}は特別な意味を持ちません。

source: On a related note, AutoHotkey syntax highlighting can be enabled for various editors.
ja: それに関連して、AutoHotkeyのシンタックスハイライトは、様々なエディターで有効にすることができます。

source: On a related note, a control's HWND can also be retrieved via MouseGetPos.
ja: なお、コントロールのHWNDはMouseGetPosで取得することもできます。

source: On a related note, a script can detect when the system is shutting down or the user is logging off via OnExit.
ja: これに関連して、スクリプトは、システムがシャットダウンするときや、ユーザーがOnExitを介してログオフするときを検出することができます。

source: On a related note, a technique similar to the above is to make a hotkey into a prefix key.
ja: これに関連して、上記と似た手法として、ホットキーをプレフィックスキーにする方法があります。

source: On a related note, addition, subtraction and comparison of dates and times can be performed with DateAdd and DateDiff.
ja: これに関連して、日時の加算、減算、比較はDateAdd関数と DateDiff関数で行うことができます。

source: On a related note, the += and -= operators are a shorthand way to increment or decrement a variable.
ja: これに関連して、+=演算子や-=演算子は、変数をインクリメントしたりデクリメントしたりする省略記法である。

source: On a related note, the OS's priority level for the entire script can be changed via ProcessSetPriority.
ja: 関連して、スクリプト全体のOSの優先度は、ProcessSetPriorityで変更できる。

source: On a related note, the built-in variables A_LineNumber and A_LineFile contain the currently executing line number and the file name to which it belongs.
ja: これに関連して、組み込み変数A_LineNumberと A_LineFileには、現在実行中の行番号とその行が属するファイル名が格納されます。

source: On a related note, the contents of the address bar and status bar can be retrieved as demonstrated at www.autohotkey.com/forum/topic19255.html.
ja: これに関連して、アドレスバーやステータスバーの内容は、www.autohotkey.com/forum/topic19255.htmlのデモのように取得することができます。

source: On a related note, the mouse cursor can be temporarily hidden via the hide-cursor example.
ja: なお、マウスカーソルは、hide-cursorの例で一時的に非表示にすることができます。

source: On a related note, the operating system offers standard dialog boxes that prompt the user to pick a font, color, or icon.
ja: また、オペレーティングシステムには、フォント、色、アイコンを選択するダイアログボックスが標準装備されています。

source: On a related note, there is a tooltip displayed whenever the user hovers the mouse over the script's tray icon.
ja: 関連して、ユーザーがスクリプトのトレイアイコンにマウスを置くと、ツールチップが表示される。

source: On a related note, to retrieve a file's 8.3 short name, follow this example:
ja: これに関連して、ファイルの8.3ショートネームを取得する場合は、次の例に従います：

source: On and Off would typically be replaced with True and False.
ja: OnとOffは、通常、Trueと Falseに置き換えられるでしょう。

source: On failure, OnMessage throws an exception.
ja: 失敗した場合、OnMessageは例外を投げます。

source: On failure, an exception is thrown and the output variables are not modified.
ja: 失敗した場合は、例外が発生し、出力変数は変更されません。

source: On failure, the new instance exits and RunWait returns.
ja: 失敗すると、新しいインスタンスは終了し、RunWaitが戻ります。

source: On most systems this is 96; it depends on the system's text size (DPI) setting.
ja: ほとんどのシステムでは96です。システムのテキストサイズ（DPI）の設定によります。

source: On most systems, this is equivalent to Explorer's Win+M and Win+D hotkeys.
ja: ほとんどのシステムでは、これはエクスプローラーのWin+Mと Win+Dのホットキーに相当します。

source: On older OSes, the script displays a confirmation prompt.
ja: 古いOSの場合、スクリプトは確認プロンプトを表示します。

source: On older operating systems, a two-digit year might be displayed.
ja: 古いOSでは、2桁の年号が表示されることがある。

source: On older operating systems, the first column might have a forced left-alignment.
ja: 古いOSでは、1列目が強制的に左寄せになる場合があります。

source: On some systems in Java applications, hotstrings might interfere with the user's ability to type diacritical letters (via dead keys).
ja: Javaアプリケーションの一部のシステムでは、ホットストリングが、（デッドキーによって）ユーザーがダイアクリティカル文字を入力する能力を妨害する可能性があります。

source: On some systems you may need to enclose the name in quotes to ensure the editor does not add another extension (such as .txt).
ja: システムによっては、エディタが別の拡張子（.txtなど）を追加しないように名前を引用符で囲む必要があります。

source: On some systems, certain file types might stop playing even when an entirely separate script plays a new file.
ja: システムによっては、まったく別のスクリプトが新しいファイルを再生しても、特定のファイルタイプの再生が停止することがあります。

source: On some versions of Windows, this style might not work properly if the GUI window is set to be always-on-top.
ja: Windowsのバージョンによっては、GUIウィンドウが常に上に表示されるように設定されている場合、このスタイルが正しく動作しないことがあります。

source: On success, /restart causes the new instance to terminate the old one.
ja: 成功すると、/restartによって新しいインスタンスが古いインスタンスを終了させます。

source: On success, the return value is an interface pointer.
ja: 成功した場合の戻り値はインターフェース・ポインターである。

source: On systems with multiple screens which have different DPI settings, the final position and size of the window may differ from the requested values due to OS DPI scaling.
ja: 異なるDPI設定を持つ複数のスクリーンを持つシステムでは、OSのDPIスケーリングにより、ウィンドウの最終的な位置とサイズが要求された値と異なる場合があります。

source: On systems with multiple screens which have different DPI settings, the returned position and size may be different than expected due to OS DPI scaling.
ja: DPI設定が異なる複数のスクリーンを持つシステムでは、OSのDPIスケーリングにより、返される位置やサイズが予想と異なる場合があります。

source: On systems with multiple screens which have different DPI settings, the returned position may be different than expected due to OS DPI scaling.
ja: DPI設定の異なる複数の画面を持つシステムでは、OSのDPIスケーリングにより、返される位置が想定と異なる場合があります。

source: On the ControlGetText page you will see this:
ja: ControlGetTextページでは、このように表示されます：

source: On the other hand, some convenience is lost.
ja: その反面、利便性が失われる部分もあります。

source: On-Screen Keyboard
ja: オンスクリーンキーボード

source: OnClipboardChange - Syntax & Usage | AutoHotkey v2
ja: OnClipboardChange - 構文と使用法｜AutoHotkey v2

source: OnCommand (GUI) - Syntax & Usage | AutoHotkey v2
ja: OnCommand (GUI) - 構文と使用法｜AutoHotkey v2

source: OnError - Syntax & Usage | AutoHotkey v2
ja: OnError - 構文と使用法｜AutoHotkey v2

source: OnError is ineffective while Try is active.
ja: Tryが有効な間はOnErrorは無効です。

source: OnEvent (GUI) - Syntax & Usage | AutoHotkey v2
ja: OnEvent (GUI) - 構文と使用法｜AutoHotkey v2

source: OnExit (*) => SystemCursor("Show") ; Ensure the cursor is made visible when the script exits.
ja: OnExit (*) => SystemCursor("Show") ; スクリプト終了時にカーソルが表示されるようにします。

source: OnExit - Syntax & Usage | AutoHotkey v2
ja: OnExit - 構文と使用法｜AutoHotkey v2

source: OnExit functions are called when the script exits by any means (except when it is killed by something like "End Task").
ja: OnExit関数は、スクリプトが何らかの手段で終了したときに呼び出されます（"End Task "などで強制終了された場合を除く）。

source: OnMessage - Syntax & Usage | AutoHotkey v2
ja: OnMessage - 構文と使用法｜AutoHotkey v2

source: OnMessage does not automatically make the script persistent, as it is sometimes unnecessary or undesired.
ja: OnMessage は、スクリプトを自動的に永続化するわけではありません。

source: OnNotify (GUI) - Syntax & Usage | AutoHotkey v2
ja: OnNotify (GUI) - 構文と使用法｜AutoHotkey v2

source: Once a DLL or EXE has been loaded by this directive it cannot be unloaded by calling the system's function FreeLibrary.
ja: このディレクティブによって一度ロードされたDLLやEXEは、システムの関数FreeLibraryを呼び出すことによってアンロードすることができません。

source: Once a column is deleted, the column numbers of any that lie to its right are reduced by 1.
ja: 列が削除されると、その右側にある列の列番号は1つ減らされます。

source: Once a file is opened in append mode, use file.Write(string) to append the string.
ja: 追記モードでファイルを開いたら、file.Write(string)を使って文字列を追記します。

source: Once a script has at least one hotkey, it becomes persistent, meaning that ExitApp rather than Exit should be used to terminate it.
ja: スクリプトに少なくとも1つのホットキーが設定されると、そのスクリプトは永続的なものとなり、終了させるにはExitではなくExitAppを使用する必要があります。

source: Once a script has at least one hotstring, it becomes persistent, meaning that ExitApp rather than Exit should be used to terminate it.
ja: スクリプトに少なくとも1つのホットストリングがあると、そのスクリプトは永続的なものになります。

source: Once a script is compiled, it becomes a standalone executable; that is, AutoHotkey.exe is not required in order to run the script.
ja: つまり、スクリプトを実行するためにAutoHotkey.exeは必要ありません。

source: Once assigned (if non-null), the pointer will be released automatically when the wrapper object is freed.
ja: 一度割り当てられると（nullでない場合）、ラッパー・オブジェクトが解放されるときに、ポインタは自動的に解放されます。

source: Once assigned a non-null pointer, the property is read-only.
ja: 非NULLポインタが割り当てられると、このプロパティは読み取り専用になります。

source: Once automatic initialization begins, it will not occur again for the same class.
ja: 一度自動初期化が開始されると、同じクラスで再び初期化が行われることはありません。

source: Once changed, the new working directory is instantly and globally in effect throughout the script.
ja: 一度変更されると、新しい作業ディレクトリは即座に、そしてスクリプト全体を通してグローバルに有効になります。。

source: Once done, great!
ja: インスールが終われば最高だ！

source: Once installation completes, the Dash is shown automatically.
ja: インストールが完了すると、自動的にDashが表示されます。

source: Once located, such objects can be clicked via Click.
ja: このようなオブジェクトは、位置が決まれば、Clickでクリックすることが可能です。

source: Once passed to the HotIf function, the object will never be deleted (but memory will be reclaimed by the OS when the process exits).
ja: HotIf関数に渡されたオブジェクトは削除されることはありません（ただし、プロセス終了時にOSによってメモリが回収されます）。

source: Once the debugger client is connected, it may detach without terminating the script by sending the "detach" DBGp command.
ja: デバッガークライアントが接続されたら、「detach」DBGp コマンドを送信することで、スクリプトを終了せずにデタッチすることができる。

source: Once the file has been created, open it for editing and copy-paste the code.
ja: ファイルを作成したら、編集用に開き、コードをコピーペーストしてください。

source: Once the interface pointer is retrieved, ComCall can be used to call its methods.
ja: インターフェイスポインターを取得したら、ComCallを使ってそのメソッドを呼び出すことができる。
